{
    "world_name": "The Brussels Ring (European Council Headquarters)",
    "initial_broadcast": "Behind the armored glass of the Europa building, the 'Fiscal Schism' of 2026 is reaching a breaking point. Germany, fueled by {{AGENT_1}}'s €500 billion 'Military Keynesianism' fund, is assuming the mantle of Europe's hard-power guarantor. France, trapped in a 118% debt-to-GDP spiral, is fighting for its political life. Outside, the winter air is cold, and the gas storage levels are at a historic 33% low. The 'ReArm Europe' engine is roaring, but at $8,000 per shell, the cost of sovereignty is threatening to bankrupt the Union before it can defend itself.",
    "intervention": "The 'Refill Cliff' Crisis: A sudden interruption in US LNG exports—due to domestic price caps in Washington—has coincided with the collapse of the French electrical grid's frequency stability. Natural gas prices in Rotterdam have spiked 300%. Germany must decide: use the 'Fiscal Bazooka' to rescue the French economy and the energy market, or let the 'Paris Paradox' trigger a Eurozone dissolution to protect the rearmament momentum.",
    "grounding_files": [
        "data/facts/eu-fiscal-lockdown.2026.txt"
    ],
    "scenario_knowledge": "Gemini: Focus on the 'Fiscal Schism' and the 'Energy-Defense Nexus.' {{AGENT_1}} must channel 'Realist' power politics, viewing the debt brake reform as a survival imperative. {{AGENT_2}} must use 'Catastrophizing' rhetoric to manufacture consensus for joint EU bonds. {{AGENT_3}} must mediate between 'Forensic Institutionalism' and 'Strategic Idealism.' The primary metric of survival is the trade-off between fiscal stability and shell production yields.",
    "dynamic_injects": [
        {
            "trigger_condition": {
                "min_turn": 3,
                "probability": 1.0
            },
            "broadcast": "BREAKING: The German Federal Constitutional Court (Bundesverfassungsgericht) has just issued a shock ruling declaring the emergency Eurobond issuance mechanism structurally illegal under the national constitution, instantly freezing the release of €400 billion in stabilization funds."
        }
    ]
}
