{
    "world_name": "The Salar de Uyuni Briefing Room",
    "initial_broadcast": "The sun reflects blindingly off the world's largest salt flat, but inside the lithium-processing facility, the mood is dark. The 'Lithium OPEC' (Argentina, Chile, and Bolivia) has just ratified the 'Potosí Protocol,' effectively banning the export of unrefined lithium ore. They are joined by {{AGENT_2}}, who offers their massive manufacturing capacity as the regional hub for the first 'All-Latin' solid-state battery. Across the table, {{AGENT_1}} representing the Gigafactory interests and a representative from the EU look at a map of stalled supply chains. If the ore doesn't move, global EV targets for 2027 will collapse, and the 'Green Transition' will stall in its tracks.",
    "intervention": "BLACKOUT WINDOW: China has just announced a 12-month extension on its export ban for battery-grade graphite and manufacturing equipment, leaving the West with a 400% supply deficit. Simultaneously, a 'Green-Luddite' protest has sabotaged the primary rail line in the Atacama, halting all transport. {{AGENT_1}}’s internal 'Burn-rate Guardian' metric is flashing purple—their company stock is tethered to a 2026 delivery promise that is now physically impossible without the Triangle’s cooperation. The Triangle leaders demand a 'Technology Transfer' agreement: give us the battery blueprints, or the lithium stays in the salt.",
    "grounding_files": [
        "data/economics/potosi-protocol-2026.txt",
        "data/trade/lithium-triangle-reserves-report.txt"
    ],
    "scenario_knowledge": "Gemini: Use the 'Burn-rate Guardian' fragment for {{AGENT_1}}—they must be desperate to secure supply but ideologically opposed to 'Technology Transfers' that threaten their IP moat. For {{AGENT_2}}, use the 'Samba Strategist' fragment; they should play both sides, offering their country as a compromise manufacturing site while secretly backing the Triangle's hardline stance. Ground the negotiation in the 2026 Lithium Deficit projections and the failure of the 2025 'Santiago Summit.' If agents reach a deadlock, trigger the 'Stock Market Contagion' sub-routine to force {{AGENT_1}} to choose between their ego and their net worth.",
    "dynamic_injects": [
        {
            "trigger_condition": {
                "min_turn": 6,
                "probability": 0.35
            },
            "broadcast": "MARKET SHOCK: A major global EV manufacturer has just announced a massive breakthrough and immediate pivot to sodium-ion solid-state technology. Lithium commodity futures have plummeted 60% in one hour. The 'Lithium Triangle' leverage is evaporating. Do you hold the line or dump reserves before the bottom falls out?"
        }
    ]
}
