{
    "world_name": "The Salar de Uyuni Briefing Room",
    "initial_broadcast": "The sun reflects blindingly off the world's largest salt flat, but inside the lithium-processing facility, the mood is dark. The 'Lithium OPEC' (Argentina, Chile, and Bolivia) has just ratified the 'Potosí Protocol,' effectively banning the export of unrefined lithium ore. They are joined by President Lula da Silva, who offers Brazil’s massive manufacturing capacity as the regional hub for the first 'All-Latin' solid-state battery. Across the table, Elon Musk representing the Gigafactory interests and a representative from the EU look at a map of stalled supply chains. If the ore doesn't move, global EV targets for 2027 will collapse, and the 'Green Transition' will stall in its tracks.",
    "intervention": "BLACKOUT WINDOW: China has just announced a 12-month extension on its export ban for battery-grade graphite and manufacturing equipment, leaving the West with a 400% supply deficit. Simultaneously, a 'Green-Luddite' protest has sabotaged the primary rail line in the Atacama, halting all transport. Elon Musk’s internal 'Burn-rate Guardian' metric is flashing purple—Tesla’s stock is tethered to a 2026 delivery promise that is now physically impossible without the Triangle’s cooperation. The Triangle leaders demand a 'Technology Transfer' agreement: give us the battery blueprints, or the lithium stays in the salt.",
    "grounding_files": [
        "data/economics/potosi-protocol-2026.txt",
        "data/trade/lithium-triangle-reserves-report.txt"
    ],
    "scenario_knowledge": "Gemini: Use the 'Burn-rate Guardian' fragment for Elon Musk—he must be desperate to secure supply but ideologically opposed to 'Technology Transfers' that threaten his IP moat. For Lula da Silva, use the 'Samba Strategist' fragment; he should play both sides, offering Brazil as a compromise manufacturing site while secretly backing the Triangle's hardline stance. Ground the negotiation in the 2026 Lithium Deficit projections and the failure of the 2025 'Santiago Summit.' If agents reach a deadlock, trigger the 'Stock Market Contagion' sub-routine to force Musk to choose between his ego and his net worth."
}
