{
    "world_name": "The Batam Nerve Center",
    "initial_broadcast": "Deep beneath the silt of the Malacca Strait, four major fiber-optic trunks—carrying 90% of the data between Mumbai, Singapore, and Jakarta—have been severed. Financial markets in Southeast Asia are in a state of 'dark-pool' paralysis. Inside the Batam Command Center, {{AGENT_1}} and {{AGENT_2}} stand before a digital map of the seabed where red icons pulse like open wounds. India has deployed its 'MAHASAGAR' naval assets to 'secure' the repair zone, citing regional stability. Indonesia, however, views this as a violation of its Archipelagic Sovereignty and has blocked the repair ships until a new 'Benthic Jurisdiction' agreement is signed. The silence of the internet is the loudest thing in the room.",
    "intervention": "TECHNO-MEDIATION: {{AGENT_3}}, acting as a 'Special Envoy for Digital Infrastructure,' joins via a low-latency satellite link. They reveal that Microsoft and the Gates Foundation are prepared to fast-track a $50 billion 'Indo-Pacific AI Grid,' but the funding is contingent on a 'Joint Cable Governance' treaty. Simultaneously, a series of 'Dark Fleet' vessels are detected loitering over the remaining intact cables. If the repair ships don't move in 12 hours, a secondary 'Blackout' will hit the Indian power grid. The choice: accept a neutral, tech-brokered patrol or risk a total regional digital collapse.",
    "grounding_files": [
        "data/security/malacca-straits-cable-forensics.2026.txt",
        "data/treaties/jakarta-maritime-accord-DRAFT.txt"
    ],
    "scenario_knowledge": "Gemini: Embody the 'Maritime Hegemon' fragment for {{AGENT_1}}—he must believe India is the only power capable of protecting the 'Global Commons.' For {{AGENT_2}}, activate the 'Nationalist Defender' fragment; he is fresh from his 2025-2026 'Red and White' village modernization push and will not tolerate foreign 'policing' in Indonesian waters. {{AGENT_3}} should use the 'Infrastructure Philanthropist' fragment, viewing the conflict as a technical bug that needs a 'Capital-as-a-Patch' solution. Use the 2026 ASEAN Subsea Resilience Standards as the primary legal friction point.",
    "dynamic_injects": [
        {
            "trigger_condition": {
                "min_turn": 3,
                "probability": 0.25
            },
            "broadcast": "CRITICAL FAILURE: Emergency at the Batam Nerve Center! A secondary cut has been confirmed on the 'Peace-Link' backup cable. 95% of trans-pacific data traffic is now being forced through a single, congested terrestrial link in Central Asia. Latency is at critical levels. Banking and logistics systems in Singapore have officially entered 'Offline Mode'."
        }
    ]
}
