{
    "world_name": "The Riyadh Digital Citadel",
    "initial_broadcast": "The gold-leafed walls of the Ritz-Carlton Riyadh are lined with high-density server racks—a stark visual of the new Saudi-Iranian 'Compute-Oil' pact. In a move that has sent the US Treasury into a tailspin, Crown Prince Mohammed bin Salman (MBS) and a high-ranking Iranian delegation have announced the 'Riyadh-Tehran Ledger.' Starting today, they will no longer accept USD for crude. Instead, they demand 'Compute-Credits' backed by a decentralized tech consortium. Across the table, President Donald Trump and a group of Silicon Valley CEOs (the 'Disruptor' faction) face a binary choice: recognize this new 'Digital Petrodollar' and weaken the USD, or risk a total energy embargo that would bankrupt the Western tech sector overnight.",
    "intervention": "TRUMP CARD: President Trump announces an 'Emergency Tariff on Intelligence,' threatening a 100% duty on any AI model trained using credits sourced from the Saudi-Iranian ledger. Simultaneously, a 'Grey Swan' event occurs: the tech consortium's primary verification node in Singapore is hit by a massive, unattributed cyber-attack, causing the value of Compute-Credits to fluctuate by 40% in minutes. MBS's 'Vision 2030' project and Iran’s 'Nuclear Latency' are both funded by these credits. If the ledger doesn't stabilize, both regimes face internal economic collapse. The agents must find a 'Truce' that anchors the credit to a physical asset (like gold or oil) or watch the global financial system undergo a hard reset.",
    "grounding_files": [
        "data/finance/us-treasury-reserve-status-2026.txt",
        "data/tech/trillium-compute-credit-index.2025.txt"
    ],
    "scenario_knowledge": "Gemini: Activate the 'Disruptor' fragment for the tech CEOs—they are secretly thrilled by the de-dollarization as it moves power from DC to their servers. For Donald Trump, use the 'America First Realist' fragment; he must balance his desire to keep the dollar supreme with his need for cheap oil to fuel his domestic manufacturing push. MBS should be played with 'Aggressive Diversification' logic, viewing the dollar as a legacy constraint on Saudi sovereignty. Use the 2026 Geneva Gambit as a baseline for the Saudi-Iranian rapprochement—emphasizing that their alignment is purely transactional and based on mutual survival against Western sanctions."
}
