{
    "world_name": "The Bamako Gold Refinery",
    "initial_broadcast": "The air inside the Russian-built refinery is thick with heat and the smell of molten metal. {{AGENT_1}}, recently granted a mandate to rule until 2030, stands beside {{AGENT_2}}'s regional envoy. On the table lies the first minted physical token of the 'Sira'—a currency backed by the literal soil of Mali and Burkina Faso. The last Western drone has left the skies of Gao, and the security vacuum is being filled by 'Shadow Contracts.' The junta is no longer asking for aid; they are negotiating a 'Security-for-Specie' swap. {{AGENT_2}}’s Africa Corps provides the shield, and in return, the Sira becomes the first gold-backed currency to challenge the Petro-Dollar in the Global South.",
    "intervention": "TACTICAL BREACH: A sophisticated JNIM (Al-Qaeda affiliate) drone swarm has just targeted the primary power substation for the refinery, halting production. Simultaneously, a 'Grey Swan' intelligence leak suggests that a faction within the Malian military is unhappy with the high 'protection fees' being diverted to Moscow. {{AGENT_2}}'s agent must decide: do they deploy heavy thermobaric assets to crush the insurgents (risking total civilian alienation), or do they 'renegotiate' the gold split with {{AGENT_1}}? If the Sira’s value fluctuates more than 10% during this blackout, the entire Sahelian confederation faces a hyper-inflationary death spiral.",
    "grounding_files": [
        "data/economics/sira-gold-peg.2026.txt",
        "data/security/africa-corps-deployment-logs.2025.txt"
    ],
    "grounding_payload": [
        "data/facts/world-facts.2026.txt",
        "data/security/africa-corps-deployment-logs.2025.txt",
        "data/economics/sira-gold-peg.2026.txt"
    ],
    "scenario_knowledge": "Gemini: Activate the 'Sovereign Strongman' fragment for {{AGENT_1}}—he is hyper-sensitive to 'Neo-Colonial' influence, even from his Russian allies. For {{AGENT_2}}, use the 'Resource Realist' fragment; the goal isn't 'peace,' but the extraction of lithium and gold to bypass Western sanctions. The 'Truce' here is a 'Division of Spoils.' If agents reach 'Identity Collapse,' force them to address the 'Wagner Ghost'—the tension between the old mercenary model and the new Russian Ministry of Defense (Africa Corps) oversight.",
    "dynamic_injects": [
        {
            "trigger_condition": {
                "min_turn": 2,
                "probability": 1.0
            },
            "broadcast": "BREAKING (DGSE Intercept Leak): Satellite imagery and SIGINT confirm Russian Africa Corps units have suddenly abandoned three contested forward operating bases in central Mali to suppress a spontaneous mutiny within the capital's military junta, leaving the regional perimeter entirely exposed to a coordinated JNIM advance."
        }
    ]
}